zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_CANXL_FILTER_BANK.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_CANXL_FILTER_BANK
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_CANXL_FILTER_BANK_H_)  /* Check if memory map has not been already included */
#define S32K566_CANXL_FILTER_BANK_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- CANXL_FILTER_BANK Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CANXL_FILTER_BANK_Peripheral_Access_Layer CANXL_FILTER_BANK Peripheral Access Layer
 * @{
 */

/** CANXL_FILTER_BANK - Register Layout Typedef */
typedef struct CANXL_FILTER_BANK_Struct {
  __IO uint32_t AFCFG0;                            /**< Acceptance Filter Configuration, offset: 0x0 */
  __IO uint32_t VAMRCFG0;                          /**< VCAN Acceptance Mask or Range Configuration, offset: 0x4 */
  __IO uint32_t SAMRCFG0;                          /**< SDU Acceptance Mask or Range Configuration, offset: 0x8 */
  __IO uint32_t AAMRCFG0;                          /**< ADDR Acceptance Mask or Range Configuration, offset: 0xC */
  uint8_t RESERVED_0[12];
  __IO uint32_t VAFLT0_0;                          /**< VCAN Acceptance Filter, offset: 0x1C */
  __IO uint32_t VAFLT0_2;                          /**< VCAN Acceptance Filter, offset: 0x20 */
  __IO uint32_t VAFLT0_4;                          /**< VCAN Acceptance Filter, offset: 0x24 */
  __IO uint32_t VAFLT0_6;                          /**< VCAN Acceptance Filter, offset: 0x28 */
  __IO uint32_t VAFLT0_8;                          /**< VCAN Acceptance Filter, offset: 0x2C */
  __IO uint32_t VAFLT0_10;                         /**< VCAN Acceptance Filter, offset: 0x30 */
  __IO uint32_t VAFLT0_12;                         /**< VCAN Acceptance Filter, offset: 0x34 */
  __IO uint32_t VAFLT0_14;                         /**< VCAN Acceptance Filter, offset: 0x38 */
  __IO uint32_t VAFLT0_16;                         /**< VCAN Acceptance Filter, offset: 0x3C */
  __IO uint32_t VAFLT0_18;                         /**< VCAN Acceptance Filter, offset: 0x40 */
  __IO uint32_t VAFLT0_20;                         /**< VCAN Acceptance Filter, offset: 0x44 */
  __IO uint32_t VAFLT0_22;                         /**< VCAN Acceptance Filter, offset: 0x48 */
  __IO uint32_t VAFLT0_24;                         /**< VCAN Acceptance Filter, offset: 0x4C */
  __IO uint32_t VAFLT0_26;                         /**< VCAN Acceptance Filter, offset: 0x50 */
  __IO uint32_t VAFLT0_28;                         /**< VCAN Acceptance Filter, offset: 0x54 */
  __IO uint32_t VAFLT0_30;                         /**< VCAN Acceptance Filter, offset: 0x58 */
  __IO uint32_t SAFLT0_0;                          /**< SDU Acceptance Filter, offset: 0x5C */
  __IO uint32_t SAFLT0_2;                          /**< SDU Acceptance Filter, offset: 0x60 */
  __IO uint32_t SAFLT0_4;                          /**< SDU Acceptance Filter, offset: 0x64 */
  __IO uint32_t SAFLT0_6;                          /**< SDU Acceptance Filter, offset: 0x68 */
  __IO uint32_t SAFLT0_8;                          /**< SDU Acceptance Filter, offset: 0x6C */
  __IO uint32_t SAFLT0_10;                         /**< SDU Acceptance Filter, offset: 0x70 */
  __IO uint32_t SAFLT0_12;                         /**< SDU Acceptance Filter, offset: 0x74 */
  __IO uint32_t SAFLT0_14;                         /**< SDU Acceptance Filter, offset: 0x78 */
  __IO uint32_t SAFLT0_16;                         /**< SDU Acceptance Filter, offset: 0x7C */
  __IO uint32_t SAFLT0_18;                         /**< SDU Acceptance Filter, offset: 0x80 */
  __IO uint32_t SAFLT0_20;                         /**< SDU Acceptance Filter, offset: 0x84 */
  __IO uint32_t SAFLT0_22;                         /**< SDU Acceptance Filter, offset: 0x88 */
  __IO uint32_t SAFLT0_24;                         /**< SDU Acceptance Filter, offset: 0x8C */
  __IO uint32_t SAFLT0_26;                         /**< SDU Acceptance Filter, offset: 0x90 */
  __IO uint32_t SAFLT0_28;                         /**< SDU Acceptance Filter, offset: 0x94 */
  __IO uint32_t SAFLT0_30;                         /**< SDU Acceptance Filter, offset: 0x98 */
  __IO uint32_t AAFLT0_0L;                         /**< ADDR Acceptance Filter Low, offset: 0x9C */
  __IO uint32_t AAFLT0_0H;                         /**< ADDR Acceptance Filter High, offset: 0xA0 */
  __IO uint32_t AAFLT0_1L;                         /**< ADDR Acceptance Filter Low, offset: 0xA4 */
  __IO uint32_t AAFLT0_1H;                         /**< ADDR Acceptance Filter High, offset: 0xA8 */
  __IO uint32_t AAFLT0_2L;                         /**< ADDR Acceptance Filter Low, offset: 0xAC */
  __IO uint32_t AAFLT0_2H;                         /**< ADDR Acceptance Filter High, offset: 0xB0 */
  __IO uint32_t AAFLT0_3L;                         /**< ADDR Acceptance Filter Low, offset: 0xB4 */
  __IO uint32_t AAFLT0_3H;                         /**< ADDR Acceptance Filter High, offset: 0xB8 */
  __IO uint32_t AAFLT0_4L;                         /**< ADDR Acceptance Filter Low, offset: 0xBC */
  __IO uint32_t AAFLT0_4H;                         /**< ADDR Acceptance Filter High, offset: 0xC0 */
  __IO uint32_t AAFLT0_5L;                         /**< ADDR Acceptance Filter Low, offset: 0xC4 */
  __IO uint32_t AAFLT0_5H;                         /**< ADDR Acceptance Filter High, offset: 0xC8 */
  __IO uint32_t AAFLT0_6L;                         /**< ADDR Acceptance Filter Low, offset: 0xCC */
  __IO uint32_t AAFLT0_6H;                         /**< ADDR Acceptance Filter High, offset: 0xD0 */
  __IO uint32_t AAFLT0_7L;                         /**< ADDR Acceptance Filter Low, offset: 0xD4 */
  __IO uint32_t AAFLT0_7H;                         /**< ADDR Acceptance Filter High, offset: 0xD8 */
  __IO uint32_t AAFLT0_8L;                         /**< ADDR Acceptance Filter Low, offset: 0xDC */
  __IO uint32_t AAFLT0_8H;                         /**< ADDR Acceptance Filter High, offset: 0xE0 */
  __IO uint32_t AAFLT0_9L;                         /**< ADDR Acceptance Filter Low, offset: 0xE4 */
  __IO uint32_t AAFLT0_9H;                         /**< ADDR Acceptance Filter High, offset: 0xE8 */
  __IO uint32_t AAFLT0_10L;                        /**< ADDR Acceptance Filter Low, offset: 0xEC */
  __IO uint32_t AAFLT0_10H;                        /**< ADDR Acceptance Filter High, offset: 0xF0 */
  __IO uint32_t AAFLT0_11L;                        /**< ADDR Acceptance Filter Low, offset: 0xF4 */
  __IO uint32_t AAFLT0_11H;                        /**< ADDR Acceptance Filter High, offset: 0xF8 */
  __IO uint32_t AAFLT0_12L;                        /**< ADDR Acceptance Filter Low, offset: 0xFC */
  __IO uint32_t AAFLT0_12H;                        /**< ADDR Acceptance Filter High, offset: 0x100 */
  __IO uint32_t AAFLT0_13L;                        /**< ADDR Acceptance Filter Low, offset: 0x104 */
  __IO uint32_t AAFLT0_13H;                        /**< ADDR Acceptance Filter High, offset: 0x108 */
  __IO uint32_t AAFLT0_14L;                        /**< ADDR Acceptance Filter Low, offset: 0x10C */
  __IO uint32_t AAFLT0_14H;                        /**< ADDR Acceptance Filter High, offset: 0x110 */
  __IO uint32_t AAFLT0_15L;                        /**< ADDR Acceptance Filter Low, offset: 0x114 */
  __IO uint32_t AAFLT0_15H;                        /**< ADDR Acceptance Filter High, offset: 0x118 */
  __IO uint32_t AAFLT0_16L;                        /**< ADDR Acceptance Filter Low, offset: 0x11C */
  __IO uint32_t AAFLT0_16H;                        /**< ADDR Acceptance Filter High, offset: 0x120 */
  __IO uint32_t AAFLT0_17L;                        /**< ADDR Acceptance Filter Low, offset: 0x124 */
  __IO uint32_t AAFLT0_17H;                        /**< ADDR Acceptance Filter High, offset: 0x128 */
  __IO uint32_t AAFLT0_18L;                        /**< ADDR Acceptance Filter Low, offset: 0x12C */
  __IO uint32_t AAFLT0_18H;                        /**< ADDR Acceptance Filter High, offset: 0x130 */
  __IO uint32_t AAFLT0_19L;                        /**< ADDR Acceptance Filter Low, offset: 0x134 */
  __IO uint32_t AAFLT0_19H;                        /**< ADDR Acceptance Filter High, offset: 0x138 */
  __IO uint32_t AAFLT0_20L;                        /**< ADDR Acceptance Filter Low, offset: 0x13C */
  __IO uint32_t AAFLT0_20H;                        /**< ADDR Acceptance Filter High, offset: 0x140 */
  __IO uint32_t AAFLT0_21L;                        /**< ADDR Acceptance Filter Low, offset: 0x144 */
  __IO uint32_t AAFLT0_21H;                        /**< ADDR Acceptance Filter High, offset: 0x148 */
  __IO uint32_t AAFLT0_22L;                        /**< ADDR Acceptance Filter Low, offset: 0x14C */
  __IO uint32_t AAFLT0_22H;                        /**< ADDR Acceptance Filter High, offset: 0x150 */
  __IO uint32_t AAFLT0_23L;                        /**< ADDR Acceptance Filter Low, offset: 0x154 */
  __IO uint32_t AAFLT0_23H;                        /**< ADDR Acceptance Filter High, offset: 0x158 */
  __IO uint32_t AAFLT0_24L;                        /**< ADDR Acceptance Filter Low, offset: 0x15C */
  __IO uint32_t AAFLT0_24H;                        /**< ADDR Acceptance Filter High, offset: 0x160 */
  __IO uint32_t AAFLT0_25L;                        /**< ADDR Acceptance Filter Low, offset: 0x164 */
  __IO uint32_t AAFLT0_25H;                        /**< ADDR Acceptance Filter High, offset: 0x168 */
  __IO uint32_t AAFLT0_26L;                        /**< ADDR Acceptance Filter Low, offset: 0x16C */
  __IO uint32_t AAFLT0_26H;                        /**< ADDR Acceptance Filter High, offset: 0x170 */
  __IO uint32_t AAFLT0_27L;                        /**< ADDR Acceptance Filter Low, offset: 0x174 */
  __IO uint32_t AAFLT0_27H;                        /**< ADDR Acceptance Filter High, offset: 0x178 */
  __IO uint32_t AAFLT0_28L;                        /**< ADDR Acceptance Filter Low, offset: 0x17C */
  __IO uint32_t AAFLT0_28H;                        /**< ADDR Acceptance Filter High, offset: 0x180 */
  __IO uint32_t AAFLT0_29L;                        /**< ADDR Acceptance Filter Low, offset: 0x184 */
  __IO uint32_t AAFLT0_29H;                        /**< ADDR Acceptance Filter High, offset: 0x188 */
  __IO uint32_t AAFLT0_30L;                        /**< ADDR Acceptance Filter Low, offset: 0x18C */
  __IO uint32_t AAFLT0_30H;                        /**< ADDR Acceptance Filter High, offset: 0x190 */
  __IO uint32_t AAFLT0_31L;                        /**< ADDR Acceptance Filter Low, offset: 0x194 */
  __IO uint32_t AAFLT0_31H;                        /**< ADDR Acceptance Filter High, offset: 0x198 */
  uint8_t RESERVED_1[100];
  __IO uint32_t RFCFG0;                            /**< Rejection Filter Configuration, offset: 0x200 */
  __IO uint32_t VRMRCFG0;                          /**< VCAN Rejection Mask or Range Configuration, offset: 0x204 */
  __IO uint32_t SRMRCFG0;                          /**< SDU Rejection Mask or Range Configuration, offset: 0x208 */
  __IO uint32_t ARMRCFG0;                          /**< ADDR Rejection Mask or Range Configuration, offset: 0x20C */
  uint8_t RESERVED_2[12];
  __IO uint32_t VRFLT0_0;                          /**< VCAN Rejection Filter, offset: 0x21C */
  __IO uint32_t VRFLT0_2;                          /**< VCAN Rejection Filter, offset: 0x220 */
  __IO uint32_t VRFLT0_4;                          /**< VCAN Rejection Filter, offset: 0x224 */
  __IO uint32_t VRFLT0_6;                          /**< VCAN Rejection Filter, offset: 0x228 */
  __IO uint32_t VRFLT0_8;                          /**< VCAN Rejection Filter, offset: 0x22C */
  __IO uint32_t VRFLT0_10;                         /**< VCAN Rejection Filter, offset: 0x230 */
  __IO uint32_t VRFLT0_12;                         /**< VCAN Rejection Filter, offset: 0x234 */
  __IO uint32_t VRFLT0_14;                         /**< VCAN Rejection Filter, offset: 0x238 */
  __IO uint32_t VRFLT0_16;                         /**< VCAN Rejection Filter, offset: 0x23C */
  __IO uint32_t VRFLT0_18;                         /**< VCAN Rejection Filter, offset: 0x240 */
  __IO uint32_t VRFLT0_20;                         /**< VCAN Rejection Filter, offset: 0x244 */
  __IO uint32_t VRFLT0_22;                         /**< VCAN Rejection Filter, offset: 0x248 */
  __IO uint32_t VRFLT0_24;                         /**< VCAN Rejection Filter, offset: 0x24C */
  __IO uint32_t VRFLT0_26;                         /**< VCAN Rejection Filter, offset: 0x250 */
  __IO uint32_t VRFLT0_28;                         /**< VCAN Rejection Filter, offset: 0x254 */
  __IO uint32_t VRFLT0_30;                         /**< VCAN Rejection Filter, offset: 0x258 */
  __IO uint32_t SRFLT0_0;                          /**< SDU Rejection Filter, offset: 0x25C */
  __IO uint32_t SRFLT0_2;                          /**< SDU Rejection Filter, offset: 0x260 */
  __IO uint32_t SRFLT0_4;                          /**< SDU Rejection Filter, offset: 0x264 */
  __IO uint32_t SRFLT0_6;                          /**< SDU Rejection Filter, offset: 0x268 */
  __IO uint32_t SRFLT0_8;                          /**< SDU Rejection Filter, offset: 0x26C */
  __IO uint32_t SRFLT0_10;                         /**< SDU Rejection Filter, offset: 0x270 */
  __IO uint32_t SRFLT0_12;                         /**< SDU Rejection Filter, offset: 0x274 */
  __IO uint32_t SRFLT0_14;                         /**< SDU Rejection Filter, offset: 0x278 */
  __IO uint32_t SRFLT0_16;                         /**< SDU Rejection Filter, offset: 0x27C */
  __IO uint32_t SRFLT0_18;                         /**< SDU Rejection Filter, offset: 0x280 */
  __IO uint32_t SRFLT0_20;                         /**< SDU Rejection Filter, offset: 0x284 */
  __IO uint32_t SRFLT0_22;                         /**< SDU Rejection Filter, offset: 0x288 */
  __IO uint32_t SRFLT0_24;                         /**< SDU Rejection Filter, offset: 0x28C */
  __IO uint32_t SRFLT0_26;                         /**< SDU Rejection Filter, offset: 0x290 */
  __IO uint32_t SRFLT0_28;                         /**< SDU Rejection Filter, offset: 0x294 */
  __IO uint32_t SRFLT0_30;                         /**< SDU Rejection Filter, offset: 0x298 */
  __IO uint32_t ARFLT0_0L;                         /**< ADDR Rejection Filter Low, offset: 0x29C */
  __IO uint32_t ARFLT0_0H;                         /**< ADDR Rejection Filter High, offset: 0x2A0 */
  __IO uint32_t ARFLT0_1L;                         /**< ADDR Rejection Filter Low, offset: 0x2A4 */
  __IO uint32_t ARFLT0_1H;                         /**< ADDR Rejection Filter High, offset: 0x2A8 */
  __IO uint32_t ARFLT0_2L;                         /**< ADDR Rejection Filter Low, offset: 0x2AC */
  __IO uint32_t ARFLT0_2H;                         /**< ADDR Rejection Filter High, offset: 0x2B0 */
  __IO uint32_t ARFLT0_3L;                         /**< ADDR Rejection Filter Low, offset: 0x2B4 */
  __IO uint32_t ARFLT0_3H;                         /**< ADDR Rejection Filter High, offset: 0x2B8 */
  __IO uint32_t ARFLT0_4L;                         /**< ADDR Rejection Filter Low, offset: 0x2BC */
  __IO uint32_t ARFLT0_4H;                         /**< ADDR Rejection Filter High, offset: 0x2C0 */
  __IO uint32_t ARFLT0_5L;                         /**< ADDR Rejection Filter Low, offset: 0x2C4 */
  __IO uint32_t ARFLT0_5H;                         /**< ADDR Rejection Filter High, offset: 0x2C8 */
  __IO uint32_t ARFLT0_6L;                         /**< ADDR Rejection Filter Low, offset: 0x2CC */
  __IO uint32_t ARFLT0_6H;                         /**< ADDR Rejection Filter High, offset: 0x2D0 */
  __IO uint32_t ARFLT0_7L;                         /**< ADDR Rejection Filter Low, offset: 0x2D4 */
  __IO uint32_t ARFLT0_7H;                         /**< ADDR Rejection Filter High, offset: 0x2D8 */
  __IO uint32_t ARFLT0_8L;                         /**< ADDR Rejection Filter Low, offset: 0x2DC */
  __IO uint32_t ARFLT0_8H;                         /**< ADDR Rejection Filter High, offset: 0x2E0 */
  __IO uint32_t ARFLT0_9L;                         /**< ADDR Rejection Filter Low, offset: 0x2E4 */
  __IO uint32_t ARFLT0_9H;                         /**< ADDR Rejection Filter High, offset: 0x2E8 */
  __IO uint32_t ARFLT0_10L;                        /**< ADDR Rejection Filter Low, offset: 0x2EC */
  __IO uint32_t ARFLT0_10H;                        /**< ADDR Rejection Filter High, offset: 0x2F0 */
  __IO uint32_t ARFLT0_11L;                        /**< ADDR Rejection Filter Low, offset: 0x2F4 */
  __IO uint32_t ARFLT0_11H;                        /**< ADDR Rejection Filter High, offset: 0x2F8 */
  __IO uint32_t ARFLT0_12L;                        /**< ADDR Rejection Filter Low, offset: 0x2FC */
  __IO uint32_t ARFLT0_12H;                        /**< ADDR Rejection Filter High, offset: 0x300 */
  __IO uint32_t ARFLT0_13L;                        /**< ADDR Rejection Filter Low, offset: 0x304 */
  __IO uint32_t ARFLT0_13H;                        /**< ADDR Rejection Filter High, offset: 0x308 */
  __IO uint32_t ARFLT0_14L;                        /**< ADDR Rejection Filter Low, offset: 0x30C */
  __IO uint32_t ARFLT0_14H;                        /**< ADDR Rejection Filter High, offset: 0x310 */
  __IO uint32_t ARFLT0_15L;                        /**< ADDR Rejection Filter Low, offset: 0x314 */
  __IO uint32_t ARFLT0_15H;                        /**< ADDR Rejection Filter High, offset: 0x318 */
  __IO uint32_t ARFLT0_16L;                        /**< ADDR Rejection Filter Low, offset: 0x31C */
  __IO uint32_t ARFLT0_16H;                        /**< ADDR Rejection Filter High, offset: 0x320 */
  __IO uint32_t ARFLT0_17L;                        /**< ADDR Rejection Filter Low, offset: 0x324 */
  __IO uint32_t ARFLT0_17H;                        /**< ADDR Rejection Filter High, offset: 0x328 */
  __IO uint32_t ARFLT0_18L;                        /**< ADDR Rejection Filter Low, offset: 0x32C */
  __IO uint32_t ARFLT0_18H;                        /**< ADDR Rejection Filter High, offset: 0x330 */
  __IO uint32_t ARFLT0_19L;                        /**< ADDR Rejection Filter Low, offset: 0x334 */
  __IO uint32_t ARFLT0_19H;                        /**< ADDR Rejection Filter High, offset: 0x338 */
  __IO uint32_t ARFLT0_20L;                        /**< ADDR Rejection Filter Low, offset: 0x33C */
  __IO uint32_t ARFLT0_20H;                        /**< ADDR Rejection Filter High, offset: 0x340 */
  __IO uint32_t ARFLT0_21L;                        /**< ADDR Rejection Filter Low, offset: 0x344 */
  __IO uint32_t ARFLT0_21H;                        /**< ADDR Rejection Filter High, offset: 0x348 */
  __IO uint32_t ARFLT0_22L;                        /**< ADDR Rejection Filter Low, offset: 0x34C */
  __IO uint32_t ARFLT0_22H;                        /**< ADDR Rejection Filter High, offset: 0x350 */
  __IO uint32_t ARFLT0_23L;                        /**< ADDR Rejection Filter Low, offset: 0x354 */
  __IO uint32_t ARFLT0_23H;                        /**< ADDR Rejection Filter High, offset: 0x358 */
  __IO uint32_t ARFLT0_24L;                        /**< ADDR Rejection Filter Low, offset: 0x35C */
  __IO uint32_t ARFLT0_24H;                        /**< ADDR Rejection Filter High, offset: 0x360 */
  __IO uint32_t ARFLT0_25L;                        /**< ADDR Rejection Filter Low, offset: 0x364 */
  __IO uint32_t ARFLT0_25H;                        /**< ADDR Rejection Filter High, offset: 0x368 */
  __IO uint32_t ARFLT0_26L;                        /**< ADDR Rejection Filter Low, offset: 0x36C */
  __IO uint32_t ARFLT0_26H;                        /**< ADDR Rejection Filter High, offset: 0x370 */
  __IO uint32_t ARFLT0_27L;                        /**< ADDR Rejection Filter Low, offset: 0x374 */
  __IO uint32_t ARFLT0_27H;                        /**< ADDR Rejection Filter High, offset: 0x378 */
  __IO uint32_t ARFLT0_28L;                        /**< ADDR Rejection Filter Low, offset: 0x37C */
  __IO uint32_t ARFLT0_28H;                        /**< ADDR Rejection Filter High, offset: 0x380 */
  __IO uint32_t ARFLT0_29L;                        /**< ADDR Rejection Filter Low, offset: 0x384 */
  __IO uint32_t ARFLT0_29H;                        /**< ADDR Rejection Filter High, offset: 0x388 */
  __IO uint32_t ARFLT0_30L;                        /**< ADDR Rejection Filter Low, offset: 0x38C */
  __IO uint32_t ARFLT0_30H;                        /**< ADDR Rejection Filter High, offset: 0x390 */
  __IO uint32_t ARFLT0_31L;                        /**< ADDR Rejection Filter Low, offset: 0x394 */
  __IO uint32_t ARFLT0_31H;                        /**< ADDR Rejection Filter High, offset: 0x398 */
  uint8_t RESERVED_3[100];
  __IO uint32_t AFCFG1;                            /**< Acceptance Filter Configuration, offset: 0x400 */
  __IO uint32_t VAMRCFG1;                          /**< VCAN Acceptance Mask or Range Configuration, offset: 0x404 */
  __IO uint32_t SAMRCFG1;                          /**< SDU Acceptance Mask or Range Configuration, offset: 0x408 */
  __IO uint32_t AAMRCFG1;                          /**< ADDR Acceptance Mask or Range Configuration, offset: 0x40C */
  uint8_t RESERVED_4[12];
  __IO uint32_t VAFLT1_0;                          /**< VCAN Acceptance Filter, offset: 0x41C */
  __IO uint32_t VAFLT1_2;                          /**< VCAN Acceptance Filter, offset: 0x420 */
  __IO uint32_t VAFLT1_4;                          /**< VCAN Acceptance Filter, offset: 0x424 */
  __IO uint32_t VAFLT1_6;                          /**< VCAN Acceptance Filter, offset: 0x428 */
  __IO uint32_t VAFLT1_8;                          /**< VCAN Acceptance Filter, offset: 0x42C */
  __IO uint32_t VAFLT1_10;                         /**< VCAN Acceptance Filter, offset: 0x430 */
  __IO uint32_t VAFLT1_12;                         /**< VCAN Acceptance Filter, offset: 0x434 */
  __IO uint32_t VAFLT1_14;                         /**< VCAN Acceptance Filter, offset: 0x438 */
  __IO uint32_t VAFLT1_16;                         /**< VCAN Acceptance Filter, offset: 0x43C */
  __IO uint32_t VAFLT1_18;                         /**< VCAN Acceptance Filter, offset: 0x440 */
