zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
  __IO uint32_t VAFLT1_20;                         /**< VCAN Acceptance Filter, offset: 0x444 */
  __IO uint32_t VAFLT1_22;                         /**< VCAN Acceptance Filter, offset: 0x448 */
  __IO uint32_t VAFLT1_24;                         /**< VCAN Acceptance Filter, offset: 0x44C */
  __IO uint32_t VAFLT1_26;                         /**< VCAN Acceptance Filter, offset: 0x450 */
  __IO uint32_t VAFLT1_28;                         /**< VCAN Acceptance Filter, offset: 0x454 */
  __IO uint32_t VAFLT1_30;                         /**< VCAN Acceptance Filter, offset: 0x458 */
  __IO uint32_t SAFLT1_0;                          /**< SDU Acceptance Filter, offset: 0x45C */
  __IO uint32_t SAFLT1_2;                          /**< SDU Acceptance Filter, offset: 0x460 */
  __IO uint32_t SAFLT1_4;                          /**< SDU Acceptance Filter, offset: 0x464 */
  __IO uint32_t SAFLT1_6;                          /**< SDU Acceptance Filter, offset: 0x468 */
  __IO uint32_t SAFLT1_8;                          /**< SDU Acceptance Filter, offset: 0x46C */
  __IO uint32_t SAFLT1_10;                         /**< SDU Acceptance Filter, offset: 0x470 */
  __IO uint32_t SAFLT1_12;                         /**< SDU Acceptance Filter, offset: 0x474 */
  __IO uint32_t SAFLT1_14;                         /**< SDU Acceptance Filter, offset: 0x478 */
  __IO uint32_t SAFLT1_16;                         /**< SDU Acceptance Filter, offset: 0x47C */
  __IO uint32_t SAFLT1_18;                         /**< SDU Acceptance Filter, offset: 0x480 */
  __IO uint32_t SAFLT1_20;                         /**< SDU Acceptance Filter, offset: 0x484 */
  __IO uint32_t SAFLT1_22;                         /**< SDU Acceptance Filter, offset: 0x488 */
  __IO uint32_t SAFLT1_24;                         /**< SDU Acceptance Filter, offset: 0x48C */
  __IO uint32_t SAFLT1_26;                         /**< SDU Acceptance Filter, offset: 0x490 */
  __IO uint32_t SAFLT1_28;                         /**< SDU Acceptance Filter, offset: 0x494 */
  __IO uint32_t SAFLT1_30;                         /**< SDU Acceptance Filter, offset: 0x498 */
  __IO uint32_t AAFLT1_0L;                         /**< ADDR Acceptance Filter Low, offset: 0x49C */
  __IO uint32_t AAFLT1_0H;                         /**< ADDR Acceptance Filter High, offset: 0x4A0 */
  __IO uint32_t AAFLT1_1L;                         /**< ADDR Acceptance Filter Low, offset: 0x4A4 */
  __IO uint32_t AAFLT1_1H;                         /**< ADDR Acceptance Filter High, offset: 0x4A8 */
  __IO uint32_t AAFLT1_2L;                         /**< ADDR Acceptance Filter Low, offset: 0x4AC */
  __IO uint32_t AAFLT1_2H;                         /**< ADDR Acceptance Filter High, offset: 0x4B0 */
  __IO uint32_t AAFLT1_3L;                         /**< ADDR Acceptance Filter Low, offset: 0x4B4 */
  __IO uint32_t AAFLT1_3H;                         /**< ADDR Acceptance Filter High, offset: 0x4B8 */
  __IO uint32_t AAFLT1_4L;                         /**< ADDR Acceptance Filter Low, offset: 0x4BC */
  __IO uint32_t AAFLT1_4H;                         /**< ADDR Acceptance Filter High, offset: 0x4C0 */
  __IO uint32_t AAFLT1_5L;                         /**< ADDR Acceptance Filter Low, offset: 0x4C4 */
  __IO uint32_t AAFLT1_5H;                         /**< ADDR Acceptance Filter High, offset: 0x4C8 */
  __IO uint32_t AAFLT1_6L;                         /**< ADDR Acceptance Filter Low, offset: 0x4CC */
  __IO uint32_t AAFLT1_6H;                         /**< ADDR Acceptance Filter High, offset: 0x4D0 */
  __IO uint32_t AAFLT1_7L;                         /**< ADDR Acceptance Filter Low, offset: 0x4D4 */
  __IO uint32_t AAFLT1_7H;                         /**< ADDR Acceptance Filter High, offset: 0x4D8 */
  __IO uint32_t AAFLT1_8L;                         /**< ADDR Acceptance Filter Low, offset: 0x4DC */
  __IO uint32_t AAFLT1_8H;                         /**< ADDR Acceptance Filter High, offset: 0x4E0 */
  __IO uint32_t AAFLT1_9L;                         /**< ADDR Acceptance Filter Low, offset: 0x4E4 */
  __IO uint32_t AAFLT1_9H;                         /**< ADDR Acceptance Filter High, offset: 0x4E8 */
  __IO uint32_t AAFLT1_10L;                        /**< ADDR Acceptance Filter Low, offset: 0x4EC */
  __IO uint32_t AAFLT1_10H;                        /**< ADDR Acceptance Filter High, offset: 0x4F0 */
  __IO uint32_t AAFLT1_11L;                        /**< ADDR Acceptance Filter Low, offset: 0x4F4 */
  __IO uint32_t AAFLT1_11H;                        /**< ADDR Acceptance Filter High, offset: 0x4F8 */
  __IO uint32_t AAFLT1_12L;                        /**< ADDR Acceptance Filter Low, offset: 0x4FC */
  __IO uint32_t AAFLT1_12H;                        /**< ADDR Acceptance Filter High, offset: 0x500 */
  __IO uint32_t AAFLT1_13L;                        /**< ADDR Acceptance Filter Low, offset: 0x504 */
  __IO uint32_t AAFLT1_13H;                        /**< ADDR Acceptance Filter High, offset: 0x508 */
  __IO uint32_t AAFLT1_14L;                        /**< ADDR Acceptance Filter Low, offset: 0x50C */
  __IO uint32_t AAFLT1_14H;                        /**< ADDR Acceptance Filter High, offset: 0x510 */
  __IO uint32_t AAFLT1_15L;                        /**< ADDR Acceptance Filter Low, offset: 0x514 */
  __IO uint32_t AAFLT1_15H;                        /**< ADDR Acceptance Filter High, offset: 0x518 */
  __IO uint32_t AAFLT1_16L;                        /**< ADDR Acceptance Filter Low, offset: 0x51C */
  __IO uint32_t AAFLT1_16H;                        /**< ADDR Acceptance Filter High, offset: 0x520 */
  __IO uint32_t AAFLT1_17L;                        /**< ADDR Acceptance Filter Low, offset: 0x524 */
  __IO uint32_t AAFLT1_17H;                        /**< ADDR Acceptance Filter High, offset: 0x528 */
  __IO uint32_t AAFLT1_18L;                        /**< ADDR Acceptance Filter Low, offset: 0x52C */
  __IO uint32_t AAFLT1_18H;                        /**< ADDR Acceptance Filter High, offset: 0x530 */
  __IO uint32_t AAFLT1_19L;                        /**< ADDR Acceptance Filter Low, offset: 0x534 */
  __IO uint32_t AAFLT1_19H;                        /**< ADDR Acceptance Filter High, offset: 0x538 */
  __IO uint32_t AAFLT1_20L;                        /**< ADDR Acceptance Filter Low, offset: 0x53C */
  __IO uint32_t AAFLT1_20H;                        /**< ADDR Acceptance Filter High, offset: 0x540 */
  __IO uint32_t AAFLT1_21L;                        /**< ADDR Acceptance Filter Low, offset: 0x544 */
  __IO uint32_t AAFLT1_21H;                        /**< ADDR Acceptance Filter High, offset: 0x548 */
  __IO uint32_t AAFLT1_22L;                        /**< ADDR Acceptance Filter Low, offset: 0x54C */
  __IO uint32_t AAFLT1_22H;                        /**< ADDR Acceptance Filter High, offset: 0x550 */
  __IO uint32_t AAFLT1_23L;                        /**< ADDR Acceptance Filter Low, offset: 0x554 */
  __IO uint32_t AAFLT1_23H;                        /**< ADDR Acceptance Filter High, offset: 0x558 */
  __IO uint32_t AAFLT1_24L;                        /**< ADDR Acceptance Filter Low, offset: 0x55C */
  __IO uint32_t AAFLT1_24H;                        /**< ADDR Acceptance Filter High, offset: 0x560 */
  __IO uint32_t AAFLT1_25L;                        /**< ADDR Acceptance Filter Low, offset: 0x564 */
  __IO uint32_t AAFLT1_25H;                        /**< ADDR Acceptance Filter High, offset: 0x568 */
  __IO uint32_t AAFLT1_26L;                        /**< ADDR Acceptance Filter Low, offset: 0x56C */
  __IO uint32_t AAFLT1_26H;                        /**< ADDR Acceptance Filter High, offset: 0x570 */
  __IO uint32_t AAFLT1_27L;                        /**< ADDR Acceptance Filter Low, offset: 0x574 */
  __IO uint32_t AAFLT1_27H;                        /**< ADDR Acceptance Filter High, offset: 0x578 */
  __IO uint32_t AAFLT1_28L;                        /**< ADDR Acceptance Filter Low, offset: 0x57C */
  __IO uint32_t AAFLT1_28H;                        /**< ADDR Acceptance Filter High, offset: 0x580 */
  __IO uint32_t AAFLT1_29L;                        /**< ADDR Acceptance Filter Low, offset: 0x584 */
  __IO uint32_t AAFLT1_29H;                        /**< ADDR Acceptance Filter High, offset: 0x588 */
  __IO uint32_t AAFLT1_30L;                        /**< ADDR Acceptance Filter Low, offset: 0x58C */
  __IO uint32_t AAFLT1_30H;                        /**< ADDR Acceptance Filter High, offset: 0x590 */
  __IO uint32_t AAFLT1_31L;                        /**< ADDR Acceptance Filter Low, offset: 0x594 */
  __IO uint32_t AAFLT1_31H;                        /**< ADDR Acceptance Filter High, offset: 0x598 */
  uint8_t RESERVED_5[100];
  __IO uint32_t RFCFG1;                            /**< Rejection Filter Configuration, offset: 0x600 */
  __IO uint32_t VRMRCFG1;                          /**< VCAN Rejection Mask or Range Configuration, offset: 0x604 */
  __IO uint32_t SRMRCFG1;                          /**< SDU Rejection Mask or Range Configuration, offset: 0x608 */
  __IO uint32_t ARMRCFG1;                          /**< ADDR Rejection Mask or Range Configuration, offset: 0x60C */
  uint8_t RESERVED_6[12];
  __IO uint32_t VRFLT1_0;                          /**< VCAN Rejection Filter, offset: 0x61C */
  __IO uint32_t VRFLT1_2;                          /**< VCAN Rejection Filter, offset: 0x620 */
  __IO uint32_t VRFLT1_4;                          /**< VCAN Rejection Filter, offset: 0x624 */
  __IO uint32_t VRFLT1_6;                          /**< VCAN Rejection Filter, offset: 0x628 */
  __IO uint32_t VRFLT1_8;                          /**< VCAN Rejection Filter, offset: 0x62C */
  __IO uint32_t VRFLT1_10;                         /**< VCAN Rejection Filter, offset: 0x630 */
  __IO uint32_t VRFLT1_12;                         /**< VCAN Rejection Filter, offset: 0x634 */
  __IO uint32_t VRFLT1_14;                         /**< VCAN Rejection Filter, offset: 0x638 */
  __IO uint32_t VRFLT1_16;                         /**< VCAN Rejection Filter, offset: 0x63C */
  __IO uint32_t VRFLT1_18;                         /**< VCAN Rejection Filter, offset: 0x640 */
  __IO uint32_t VRFLT1_20;                         /**< VCAN Rejection Filter, offset: 0x644 */
  __IO uint32_t VRFLT1_22;                         /**< VCAN Rejection Filter, offset: 0x648 */
  __IO uint32_t VRFLT1_24;                         /**< VCAN Rejection Filter, offset: 0x64C */
  __IO uint32_t VRFLT1_26;                         /**< VCAN Rejection Filter, offset: 0x650 */
  __IO uint32_t VRFLT1_28;                         /**< VCAN Rejection Filter, offset: 0x654 */
  __IO uint32_t VRFLT1_30;                         /**< VCAN Rejection Filter, offset: 0x658 */
  __IO uint32_t SRFLT1_0;                          /**< SDU Rejection Filter, offset: 0x65C */
  __IO uint32_t SRFLT1_2;                          /**< SDU Rejection Filter, offset: 0x660 */
  __IO uint32_t SRFLT1_4;                          /**< SDU Rejection Filter, offset: 0x664 */
  __IO uint32_t SRFLT1_6;                          /**< SDU Rejection Filter, offset: 0x668 */
  __IO uint32_t SRFLT1_8;                          /**< SDU Rejection Filter, offset: 0x66C */
  __IO uint32_t SRFLT1_10;                         /**< SDU Rejection Filter, offset: 0x670 */
  __IO uint32_t SRFLT1_12;                         /**< SDU Rejection Filter, offset: 0x674 */
  __IO uint32_t SRFLT1_14;                         /**< SDU Rejection Filter, offset: 0x678 */
  __IO uint32_t SRFLT1_16;                         /**< SDU Rejection Filter, offset: 0x67C */
  __IO uint32_t SRFLT1_18;                         /**< SDU Rejection Filter, offset: 0x680 */
  __IO uint32_t SRFLT1_20;                         /**< SDU Rejection Filter, offset: 0x684 */
  __IO uint32_t SRFLT1_22;                         /**< SDU Rejection Filter, offset: 0x688 */
  __IO uint32_t SRFLT1_24;                         /**< SDU Rejection Filter, offset: 0x68C */
  __IO uint32_t SRFLT1_26;                         /**< SDU Rejection Filter, offset: 0x690 */
  __IO uint32_t SRFLT1_28;                         /**< SDU Rejection Filter, offset: 0x694 */
  __IO uint32_t SRFLT1_30;                         /**< SDU Rejection Filter, offset: 0x698 */
  __IO uint32_t ARFLT1_0L;                         /**< ADDR Rejection Filter Low, offset: 0x69C */
  __IO uint32_t ARFLT1_0H;                         /**< ADDR Rejection Filter High, offset: 0x6A0 */
  __IO uint32_t ARFLT1_1L;                         /**< ADDR Rejection Filter Low, offset: 0x6A4 */
  __IO uint32_t ARFLT1_1H;                         /**< ADDR Rejection Filter High, offset: 0x6A8 */
  __IO uint32_t ARFLT1_2L;                         /**< ADDR Rejection Filter Low, offset: 0x6AC */
  __IO uint32_t ARFLT1_2H;                         /**< ADDR Rejection Filter High, offset: 0x6B0 */
  __IO uint32_t ARFLT1_3L;                         /**< ADDR Rejection Filter Low, offset: 0x6B4 */
  __IO uint32_t ARFLT1_3H;                         /**< ADDR Rejection Filter High, offset: 0x6B8 */
  __IO uint32_t ARFLT1_4L;                         /**< ADDR Rejection Filter Low, offset: 0x6BC */
  __IO uint32_t ARFLT1_4H;                         /**< ADDR Rejection Filter High, offset: 0x6C0 */
  __IO uint32_t ARFLT1_5L;                         /**< ADDR Rejection Filter Low, offset: 0x6C4 */
  __IO uint32_t ARFLT1_5H;                         /**< ADDR Rejection Filter High, offset: 0x6C8 */
  __IO uint32_t ARFLT1_6L;                         /**< ADDR Rejection Filter Low, offset: 0x6CC */
  __IO uint32_t ARFLT1_6H;                         /**< ADDR Rejection Filter High, offset: 0x6D0 */
  __IO uint32_t ARFLT1_7L;                         /**< ADDR Rejection Filter Low, offset: 0x6D4 */
  __IO uint32_t ARFLT1_7H;                         /**< ADDR Rejection Filter High, offset: 0x6D8 */
  __IO uint32_t ARFLT1_8L;                         /**< ADDR Rejection Filter Low, offset: 0x6DC */
  __IO uint32_t ARFLT1_8H;                         /**< ADDR Rejection Filter High, offset: 0x6E0 */
  __IO uint32_t ARFLT1_9L;                         /**< ADDR Rejection Filter Low, offset: 0x6E4 */
  __IO uint32_t ARFLT1_9H;                         /**< ADDR Rejection Filter High, offset: 0x6E8 */
  __IO uint32_t ARFLT1_10L;                        /**< ADDR Rejection Filter Low, offset: 0x6EC */
  __IO uint32_t ARFLT1_10H;                        /**< ADDR Rejection Filter High, offset: 0x6F0 */
  __IO uint32_t ARFLT1_11L;                        /**< ADDR Rejection Filter Low, offset: 0x6F4 */
  __IO uint32_t ARFLT1_11H;                        /**< ADDR Rejection Filter High, offset: 0x6F8 */
  __IO uint32_t ARFLT1_12L;                        /**< ADDR Rejection Filter Low, offset: 0x6FC */
  __IO uint32_t ARFLT1_12H;                        /**< ADDR Rejection Filter High, offset: 0x700 */
  __IO uint32_t ARFLT1_13L;                        /**< ADDR Rejection Filter Low, offset: 0x704 */
  __IO uint32_t ARFLT1_13H;                        /**< ADDR Rejection Filter High, offset: 0x708 */
  __IO uint32_t ARFLT1_14L;                        /**< ADDR Rejection Filter Low, offset: 0x70C */
  __IO uint32_t ARFLT1_14H;                        /**< ADDR Rejection Filter High, offset: 0x710 */
  __IO uint32_t ARFLT1_15L;                        /**< ADDR Rejection Filter Low, offset: 0x714 */
  __IO uint32_t ARFLT1_15H;                        /**< ADDR Rejection Filter High, offset: 0x718 */
  __IO uint32_t ARFLT1_16L;                        /**< ADDR Rejection Filter Low, offset: 0x71C */
  __IO uint32_t ARFLT1_16H;                        /**< ADDR Rejection Filter High, offset: 0x720 */
  __IO uint32_t ARFLT1_17L;                        /**< ADDR Rejection Filter Low, offset: 0x724 */
  __IO uint32_t ARFLT1_17H;                        /**< ADDR Rejection Filter High, offset: 0x728 */
  __IO uint32_t ARFLT1_18L;                        /**< ADDR Rejection Filter Low, offset: 0x72C */
  __IO uint32_t ARFLT1_18H;                        /**< ADDR Rejection Filter High, offset: 0x730 */
  __IO uint32_t ARFLT1_19L;                        /**< ADDR Rejection Filter Low, offset: 0x734 */
  __IO uint32_t ARFLT1_19H;                        /**< ADDR Rejection Filter High, offset: 0x738 */
  __IO uint32_t ARFLT1_20L;                        /**< ADDR Rejection Filter Low, offset: 0x73C */
  __IO uint32_t ARFLT1_20H;                        /**< ADDR Rejection Filter High, offset: 0x740 */
  __IO uint32_t ARFLT1_21L;                        /**< ADDR Rejection Filter Low, offset: 0x744 */
  __IO uint32_t ARFLT1_21H;                        /**< ADDR Rejection Filter High, offset: 0x748 */
  __IO uint32_t ARFLT1_22L;                        /**< ADDR Rejection Filter Low, offset: 0x74C */
  __IO uint32_t ARFLT1_22H;                        /**< ADDR Rejection Filter High, offset: 0x750 */
  __IO uint32_t ARFLT1_23L;                        /**< ADDR Rejection Filter Low, offset: 0x754 */
  __IO uint32_t ARFLT1_23H;                        /**< ADDR Rejection Filter High, offset: 0x758 */
  __IO uint32_t ARFLT1_24L;                        /**< ADDR Rejection Filter Low, offset: 0x75C */
  __IO uint32_t ARFLT1_24H;                        /**< ADDR Rejection Filter High, offset: 0x760 */
  __IO uint32_t ARFLT1_25L;                        /**< ADDR Rejection Filter Low, offset: 0x764 */
  __IO uint32_t ARFLT1_25H;                        /**< ADDR Rejection Filter High, offset: 0x768 */
  __IO uint32_t ARFLT1_26L;                        /**< ADDR Rejection Filter Low, offset: 0x76C */
  __IO uint32_t ARFLT1_26H;                        /**< ADDR Rejection Filter High, offset: 0x770 */
  __IO uint32_t ARFLT1_27L;                        /**< ADDR Rejection Filter Low, offset: 0x774 */
  __IO uint32_t ARFLT1_27H;                        /**< ADDR Rejection Filter High, offset: 0x778 */
  __IO uint32_t ARFLT1_28L;                        /**< ADDR Rejection Filter Low, offset: 0x77C */
  __IO uint32_t ARFLT1_28H;                        /**< ADDR Rejection Filter High, offset: 0x780 */
  __IO uint32_t ARFLT1_29L;                        /**< ADDR Rejection Filter Low, offset: 0x784 */
  __IO uint32_t ARFLT1_29H;                        /**< ADDR Rejection Filter High, offset: 0x788 */
  __IO uint32_t ARFLT1_30L;                        /**< ADDR Rejection Filter Low, offset: 0x78C */
  __IO uint32_t ARFLT1_30H;                        /**< ADDR Rejection Filter High, offset: 0x790 */
  __IO uint32_t ARFLT1_31L;                        /**< ADDR Rejection Filter Low, offset: 0x794 */
  __IO uint32_t ARFLT1_31H;                        /**< ADDR Rejection Filter High, offset: 0x798 */
} CANXL_FILTER_BANK_Type, *CANXL_FILTER_BANK_MemMapPtr;

/** Number of instances of the CANXL_FILTER_BANK module. */
#define CANXL_FILTER_BANK_INSTANCE_COUNT         (1u)

/* CANXL_FILTER_BANK - Peripheral instance base addresses */
/** Peripheral CANEXCEL__FILTER_BANK base address */
#define IP_CANEXCEL__FILTER_BANK_BASE            (0x6A022000u)
/** Peripheral CANEXCEL__FILTER_BANK base pointer */
#define IP_CANEXCEL__FILTER_BANK                 ((CANXL_FILTER_BANK_Type *)IP_CANEXCEL__FILTER_BANK_BASE)
/** Array initializer of CANXL_FILTER_BANK peripheral base addresses */
#define IP_CANXL_FILTER_BANK_BASE_ADDRS          { IP_CANEXCEL__FILTER_BANK_BASE }
/** Array initializer of CANXL_FILTER_BANK peripheral base pointers */
#define IP_CANXL_FILTER_BANK_BASE_PTRS           { IP_CANEXCEL__FILTER_BANK }

/* ----------------------------------------------------------------------------
   -- CANXL_FILTER_BANK Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CANXL_FILTER_BANK_Register_Masks CANXL_FILTER_BANK Register Masks
 * @{
 */

/*! @name AFCFG0 - Acceptance Filter Configuration */
/*! @{ */

#define CANXL_FILTER_BANK_AFCFG0_ACPTVCAN_MASK   (0x1FU)
#define CANXL_FILTER_BANK_AFCFG0_ACPTVCAN_SHIFT  (0U)
#define CANXL_FILTER_BANK_AFCFG0_ACPTVCAN_WIDTH  (5U)
#define CANXL_FILTER_BANK_AFCFG0_ACPTVCAN(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AFCFG0_ACPTVCAN_SHIFT)) & CANXL_FILTER_BANK_AFCFG0_ACPTVCAN_MASK)

#define CANXL_FILTER_BANK_AFCFG0_AVCANEN_MASK    (0x80U)
#define CANXL_FILTER_BANK_AFCFG0_AVCANEN_SHIFT   (7U)
#define CANXL_FILTER_BANK_AFCFG0_AVCANEN_WIDTH   (1U)
#define CANXL_FILTER_BANK_AFCFG0_AVCANEN(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AFCFG0_AVCANEN_SHIFT)) & CANXL_FILTER_BANK_AFCFG0_AVCANEN_MASK)

