zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R23_MASK (0x800000U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R23_SHIFT (23U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R23_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R23(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG0_AMSK0R23_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG0_AMSK0R23_MASK)

#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R24_MASK (0x1000000U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R24_SHIFT (24U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R24_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R24(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG0_AMSK0R24_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG0_AMSK0R24_MASK)

#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R25_MASK (0x2000000U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R25_SHIFT (25U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R25_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R25(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG0_AMSK0R25_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG0_AMSK0R25_MASK)

#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R26_MASK (0x4000000U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R26_SHIFT (26U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R26_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R26(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG0_AMSK0R26_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG0_AMSK0R26_MASK)

#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R27_MASK (0x8000000U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R27_SHIFT (27U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R27_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R27(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG0_AMSK0R27_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG0_AMSK0R27_MASK)

#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R28_MASK (0x10000000U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R28_SHIFT (28U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R28_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R28(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG0_AMSK0R28_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG0_AMSK0R28_MASK)

#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R29_MASK (0x20000000U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R29_SHIFT (29U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R29_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R29(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG0_AMSK0R29_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG0_AMSK0R29_MASK)

#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R30_MASK (0x40000000U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R30_SHIFT (30U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R30_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R30(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG0_AMSK0R30_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG0_AMSK0R30_MASK)

#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R31_MASK (0x80000000U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R31_SHIFT (31U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R31_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG0_AMSK0R31(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG0_AMSK0R31_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG0_AMSK0R31_MASK)
/*! @} */

/*! @name VAFLT0_0 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT0_0_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_0_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_0_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_0_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_0_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_0_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT0_0_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_0_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_0_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_0_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_0_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_0_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_0_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT0_2 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT0_2_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_2_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_2_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_2_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_2_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_2_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT0_2_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_2_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_2_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_2_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_2_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_2_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_2_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT0_4 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT0_4_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_4_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_4_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_4_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_4_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_4_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT0_4_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_4_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_4_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_4_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_4_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_4_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_4_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT0_6 - VCAN Acceptance Filter */
/*! @{ */

