zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_VAFLT0_22_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT0_22_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT0_22_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_22_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_22_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_22_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_22_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT0_22_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT0_22_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_22_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_22_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_22_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT0_24 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT0_24_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_24_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_24_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_24_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_24_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_24_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT0_24_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_24_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_24_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_24_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_24_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_24_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_24_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT0_26 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT0_26_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_26_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_26_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_26_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_26_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_26_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT0_26_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_26_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_26_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_26_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_26_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_26_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_26_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT0_28 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT0_28_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_28_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_28_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_28_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_28_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_28_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT0_28_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_28_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_28_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_28_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_28_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_28_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_28_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT0_30 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT0_30_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_30_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_30_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_30_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_30_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_30_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT0_30_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_30_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_30_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT0_30_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT0_30_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT0_30_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT0_30_VCANb_H_MASK)
/*! @} */

/*! @name SAFLT0_0 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT0_0_SDUa_L_MASK   (0xFFU)
#define CANXL_FILTER_BANK_SAFLT0_0_SDUa_L_SHIFT  (0U)
#define CANXL_FILTER_BANK_SAFLT0_0_SDUa_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT0_0_SDUa_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_0_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_0_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT0_0_SDUa_H_MASK   (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT0_0_SDUa_H_SHIFT  (8U)
#define CANXL_FILTER_BANK_SAFLT0_0_SDUa_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT0_0_SDUa_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_0_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_0_SDUa_H_MASK)

