zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_SAFLT0_12_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT0_12_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT0_12_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_12_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_12_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_12_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT0_14 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT0_14_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_14_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_14_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT0_14_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_14_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_14_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT0_14_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_14_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_14_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT0_14_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_14_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_14_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_14_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT0_16 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT0_16_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_16_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_16_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT0_16_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_16_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_16_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT0_16_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_16_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_16_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT0_16_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_16_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_16_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_16_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT0_18 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT0_18_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_18_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_18_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT0_18_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_18_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_18_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT0_18_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_18_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_18_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT0_18_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_18_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_18_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_18_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT0_20 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT0_20_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_20_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_20_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT0_20_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_20_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_20_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT0_20_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_20_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_20_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT0_20_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_20_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_20_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_20_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT0_22 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT0_22_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT0_22_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT0_22_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_22_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_22_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_22_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT0_22_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT0_22_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT0_22_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_22_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_22_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_22_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT0_22_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT0_22_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT0_22_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT0_22_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT0_22_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT0_22_SDUb_L_MASK)

