zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name AAFLT0_0L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_0L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_0L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_0L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_0L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_0L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_0L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_0H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_0H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_0H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_0H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_0H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_0H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_0H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_1L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_1L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_1L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_1L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_1L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_1L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_1L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_1H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_1H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_1H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_1H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_1H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_1H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_1H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_2L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_2L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_2L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_2L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_2L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_2L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_2L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_2H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_2H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_2H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_2H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_2H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_2H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_2H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_3L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_3L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_3L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_3L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_3L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_3L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_3L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_3H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_3H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_3H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_3H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_3H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_3H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_3H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_4L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_4L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_4L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_4L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_4L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_4L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_4L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_4H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_4H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_4H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_4H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_4H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_4H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_4H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_5L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_5L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_5L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_5L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_5L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_5L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_5L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_5H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_5H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_5H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_5H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_5H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_5H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_5H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_6L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_6L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_6L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_6L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_6L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_6L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_6L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_6H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_6H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_6H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_6H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_6H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_6H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_6H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_7L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_7L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_7L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_7L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_7L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_7L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_7L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_7H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_7H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_7H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_7H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_7H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_7H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_7H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_8L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_8L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_8L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_8L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_8L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_8L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_8L_ADDRn_L_MASK)
/*! @} */

