zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name AAFLT0_8H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_8H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_8H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_8H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_8H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_8H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_8H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_9L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_9L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_9L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_9L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_9L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_9L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_9L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_9H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_9H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_9H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_9H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_9H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_9H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_9H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_10L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_10L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_10L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_10L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_10L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_10L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_10L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_10H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_10H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_10H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_10H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_10H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_10H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_10H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_11L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_11L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_11L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_11L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_11L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_11L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_11L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_11H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_11H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_11H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_11H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_11H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_11H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_11H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_12L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_12L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_12L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_12L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_12L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_12L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_12L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_12H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_12H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_12H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_12H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_12H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_12H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_12H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_13L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_13L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_13L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_13L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_13L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_13L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_13L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_13H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_13H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_13H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_13H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_13H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_13H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_13H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_14L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_14L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_14L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_14L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_14L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_14L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_14L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_14H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_14H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_14H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_14H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_14H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_14H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_14H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_15L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_15L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_15L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_15L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_15L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_15L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_15L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_15H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_15H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_15H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_15H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_15H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_15H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_15H_ADDRn_H_MASK)
/*! @} */

