zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name AAFLT0_16L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_16L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_16L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_16L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_16L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_16L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_16L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_16H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_16H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_16H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_16H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_16H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_16H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_16H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_17L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_17L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_17L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_17L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_17L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_17L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_17L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_17H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_17H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_17H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_17H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_17H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_17H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_17H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_18L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_18L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_18L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_18L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_18L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_18L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_18L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_18H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_18H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_18H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_18H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_18H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_18H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_18H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_19L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_19L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_19L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_19L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_19L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_19L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_19L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_19H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_19H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_19H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_19H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_19H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_19H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_19H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_20L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_20L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_20L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_20L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_20L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_20L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_20L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_20H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_20H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_20H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_20H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_20H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_20H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_20H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_21L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_21L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_21L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_21L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_21L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_21L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_21L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_21H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_21H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_21H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_21H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_21H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_21H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_21H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_22L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_22L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_22L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_22L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_22L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_22L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_22L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_22H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_22H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_22H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_22H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_22H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_22H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_22H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_23L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_23L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_23L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_23L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_23L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_23L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_23L_ADDRn_L_MASK)
/*! @} */

