zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name AAFLT0_23H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_23H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_23H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_23H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_23H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_23H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_23H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_24L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_24L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_24L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_24L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_24L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_24L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_24L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_24H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_24H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_24H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_24H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_24H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_24H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_24H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_25L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_25L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_25L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_25L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_25L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_25L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_25L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_25H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_25H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_25H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_25H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_25H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_25H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_25H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_26L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_26L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_26L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_26L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_26L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_26L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_26L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_26H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_26H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_26H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_26H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_26H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_26H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_26H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_27L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_27L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_27L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_27L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_27L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_27L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_27L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_27H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_27H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_27H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_27H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_27H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_27H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_27H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_28L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_28L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_28L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_28L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_28L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_28L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_28L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_28H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_28H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_28H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_28H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_28H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_28H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_28H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_29L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_29L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_29L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_29L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_29L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_29L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_29L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_29H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_29H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_29H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_29H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_29H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_29H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_29H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_30L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_30L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_30L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_30L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_30L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_30L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_30L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT0_30H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_30H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_30H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_30H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_30H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_30H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_30H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT0_31L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT0_31L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT0_31L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT0_31L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT0_31L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT0_31L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT0_31L_ADDRn_L_MASK)
/*! @} */

