zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R9_MASK  (0x200U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R9_SHIFT (9U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R9_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R9(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R9_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R9_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R10_MASK (0x400U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R10_SHIFT (10U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R10_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R10(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R10_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R10_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R11_MASK (0x800U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R11_SHIFT (11U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R11_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R11(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R11_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R11_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R12_MASK (0x1000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R12_SHIFT (12U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R12_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R12(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R12_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R12_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R13_MASK (0x2000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R13_SHIFT (13U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R13_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R13(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R13_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R13_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R14_MASK (0x4000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R14_SHIFT (14U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R14_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R14(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R14_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R14_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R15_MASK (0x8000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R15_SHIFT (15U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R15_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R15(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R15_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R15_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R16_MASK (0x10000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R16_SHIFT (16U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R16_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R16(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R16_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R16_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R17_MASK (0x20000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R17_SHIFT (17U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R17_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R17(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R17_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R17_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R18_MASK (0x40000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R18_SHIFT (18U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R18_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R18(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R18_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R18_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R19_MASK (0x80000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R19_SHIFT (19U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R19_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R19(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R19_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R19_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R20_MASK (0x100000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R20_SHIFT (20U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R20_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R20(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R20_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R20_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R21_MASK (0x200000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R21_SHIFT (21U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R21_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R21(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R21_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R21_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R22_MASK (0x400000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R22_SHIFT (22U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R22_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R22(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R22_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R22_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R23_MASK (0x800000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R23_SHIFT (23U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R23_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R23(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R23_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R23_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R24_MASK (0x1000000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R24_SHIFT (24U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R24_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R24(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R24_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R24_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R25_MASK (0x2000000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R25_SHIFT (25U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R25_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R25(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R25_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R25_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R26_MASK (0x4000000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R26_SHIFT (26U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R26_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R26(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R26_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R26_MASK)

#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R27_MASK (0x8000000U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R27_SHIFT (27U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R27_WIDTH (1U)
#define CANXL_FILTER_BANK_SRMRCFG0_SMSK0R27(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRMRCFG0_SMSK0R27_SHIFT)) & CANXL_FILTER_BANK_SRMRCFG0_SMSK0R27_MASK)

