zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R14_MASK (0x4000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R14_SHIFT (14U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R14_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R14(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R14_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R14_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R15_MASK (0x8000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R15_SHIFT (15U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R15_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R15(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R15_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R15_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R16_MASK (0x10000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R16_SHIFT (16U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R16_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R16(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R16_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R16_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R17_MASK (0x20000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R17_SHIFT (17U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R17_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R17(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R17_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R17_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R18_MASK (0x40000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R18_SHIFT (18U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R18_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R18(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R18_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R18_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R19_MASK (0x80000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R19_SHIFT (19U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R19_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R19(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R19_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R19_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R20_MASK (0x100000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R20_SHIFT (20U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R20_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R20(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R20_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R20_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R21_MASK (0x200000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R21_SHIFT (21U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R21_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R21(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R21_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R21_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R22_MASK (0x400000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R22_SHIFT (22U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R22_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R22(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R22_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R22_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R23_MASK (0x800000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R23_SHIFT (23U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R23_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R23(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R23_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R23_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R24_MASK (0x1000000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R24_SHIFT (24U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R24_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R24(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R24_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R24_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R25_MASK (0x2000000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R25_SHIFT (25U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R25_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R25(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R25_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R25_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R26_MASK (0x4000000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R26_SHIFT (26U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R26_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R26(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R26_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R26_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R27_MASK (0x8000000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R27_SHIFT (27U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R27_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R27(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R27_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R27_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R28_MASK (0x10000000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R28_SHIFT (28U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R28_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R28(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R28_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R28_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R29_MASK (0x20000000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R29_SHIFT (29U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R29_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R29(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R29_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R29_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R30_MASK (0x40000000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R30_SHIFT (30U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R30_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R30(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R30_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R30_MASK)

#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R31_MASK (0x80000000U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R31_SHIFT (31U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R31_WIDTH (1U)
#define CANXL_FILTER_BANK_ARMRCFG0_AMSK0R31(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARMRCFG0_AMSK0R31_SHIFT)) & CANXL_FILTER_BANK_ARMRCFG0_AMSK0R31_MASK)
/*! @} */

