zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name VRFLT0_0 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT0_0_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_0_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_0_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_0_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_0_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_0_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT0_0_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_0_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_0_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_0_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_0_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_0_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_0_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT0_2 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT0_2_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_2_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_2_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_2_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_2_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_2_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT0_2_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_2_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_2_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_2_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_2_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_2_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_2_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT0_4 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT0_4_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_4_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_4_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_4_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_4_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_4_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT0_4_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_4_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_4_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_4_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_4_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_4_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_4_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT0_6 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT0_6_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_6_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_6_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_6_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_6_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_6_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT0_6_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_6_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_6_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_6_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_6_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_6_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_6_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT0_8 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT0_8_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_8_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_8_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_8_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_8_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_8_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT0_8_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_8_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_8_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_8_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_8_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_8_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_8_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT0_10 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT0_10_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_10_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_10_VCANa_L_MASK)

