zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_VRFLT0_10_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_10_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_10_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT0_10_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_10_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_10_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_10_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_10_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_10_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_10_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT0_12 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT0_12_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_12_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_12_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_12_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_12_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_12_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT0_12_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_12_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_12_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_12_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_12_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_12_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_12_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT0_14 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT0_14_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_14_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_14_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_14_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_14_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_14_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT0_14_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_14_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_14_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_14_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_14_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_14_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_14_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT0_16 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT0_16_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_16_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_16_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_16_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_16_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_16_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT0_16_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_16_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_16_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_16_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_16_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_16_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_16_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT0_18 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT0_18_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_18_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_18_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_18_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_18_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_18_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT0_18_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_18_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_18_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_18_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_18_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_18_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_18_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT0_20 - VCAN Rejection Filter */
/*! @{ */

