zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_VRFLT0_28_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_28_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_28_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_28_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_28_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_28_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_28_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_28_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_28_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_28_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_28_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_28_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT0_30 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT0_30_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_30_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_30_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_30_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_30_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_30_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT0_30_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_30_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_30_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT0_30_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT0_30_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT0_30_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT0_30_VCANb_H_MASK)
/*! @} */

/*! @name SRFLT0_0 - SDU Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SRFLT0_0_SDUa_L_MASK   (0xFFU)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUa_L_SHIFT  (0U)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUa_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUa_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_0_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_0_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SRFLT0_0_SDUa_H_MASK   (0xFF00U)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUa_H_SHIFT  (8U)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUa_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUa_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_0_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_0_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SRFLT0_0_SDUb_L_MASK   (0xFF0000U)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUb_L_SHIFT  (16U)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUb_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUb_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_0_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_0_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SRFLT0_0_SDUb_H_MASK   (0xFF000000U)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUb_H_SHIFT  (24U)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUb_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_0_SDUb_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_0_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_0_SDUb_H_MASK)
/*! @} */

/*! @name SRFLT0_2 - SDU Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SRFLT0_2_SDUa_L_MASK   (0xFFU)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUa_L_SHIFT  (0U)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUa_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUa_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_2_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_2_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SRFLT0_2_SDUa_H_MASK   (0xFF00U)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUa_H_SHIFT  (8U)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUa_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUa_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_2_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_2_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SRFLT0_2_SDUb_L_MASK   (0xFF0000U)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUb_L_SHIFT  (16U)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUb_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUb_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_2_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_2_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SRFLT0_2_SDUb_H_MASK   (0xFF000000U)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUb_H_SHIFT  (24U)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUb_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_2_SDUb_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_2_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_2_SDUb_H_MASK)
/*! @} */

/*! @name SRFLT0_4 - SDU Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SRFLT0_4_SDUa_L_MASK   (0xFFU)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUa_L_SHIFT  (0U)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUa_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUa_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_4_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_4_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SRFLT0_4_SDUa_H_MASK   (0xFF00U)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUa_H_SHIFT  (8U)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUa_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUa_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_4_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_4_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SRFLT0_4_SDUb_L_MASK   (0xFF0000U)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUb_L_SHIFT  (16U)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUb_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUb_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_4_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_4_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SRFLT0_4_SDUb_H_MASK   (0xFF000000U)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUb_H_SHIFT  (24U)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUb_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SRFLT0_4_SDUb_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT0_4_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT0_4_SDUb_H_MASK)
/*! @} */

/*! @name SRFLT0_6 - SDU Rejection Filter */
/*! @{ */

