zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name ARFLT0_1L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_1L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_1L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_1L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_1L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_1L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_1L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_1H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_1H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_1H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_1H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_1H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_1H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_1H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_2L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_2L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_2L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_2L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_2L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_2L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_2L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_2H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_2H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_2H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_2H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_2H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_2H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_2H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_3L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_3L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_3L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_3L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_3L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_3L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_3L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_3H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_3H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_3H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_3H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_3H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_3H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_3H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_4L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_4L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_4L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_4L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_4L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_4L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_4L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_4H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_4H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_4H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_4H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_4H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_4H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_4H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_5L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_5L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_5L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_5L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_5L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_5L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_5L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_5H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_5H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_5H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_5H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_5H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_5H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_5H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_6L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_6L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_6L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_6L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_6L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_6L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_6L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_6H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_6H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_6H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_6H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_6H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_6H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_6H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_7L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_7L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_7L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_7L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_7L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_7L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_7L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_7H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_7H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_7H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_7H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_7H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_7H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_7H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_8L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_8L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_8L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_8L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_8L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_8L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_8L_ADDRn_L_MASK)
/*! @} */

