zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name ARFLT0_8H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_8H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_8H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_8H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_8H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_8H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_8H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_9L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_9L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_9L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_9L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_9L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_9L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_9L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_9H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_9H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_9H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_9H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_9H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_9H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_9H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_10L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_10L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_10L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_10L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_10L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_10L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_10L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_10H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_10H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_10H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_10H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_10H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_10H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_10H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_11L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_11L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_11L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_11L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_11L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_11L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_11L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_11H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_11H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_11H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_11H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_11H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_11H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_11H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_12L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_12L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_12L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_12L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_12L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_12L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_12L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_12H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_12H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_12H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_12H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_12H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_12H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_12H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_13L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_13L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_13L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_13L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_13L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_13L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_13L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_13H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_13H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_13H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_13H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_13H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_13H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_13H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_14L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_14L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_14L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_14L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_14L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_14L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_14L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_14H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_14H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_14H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_14H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_14H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_14H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_14H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_15L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_15L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_15L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_15L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_15L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_15L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_15L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_15H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_15H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_15H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_15H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_15H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_15H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_15H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_16L - ADDR Rejection Filter Low */
/*! @{ */

