zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_ARFLT0_16L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_16L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_16L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_16L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_16L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_16L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_16H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_16H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_16H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_16H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_16H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_16H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_16H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_17L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_17L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_17L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_17L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_17L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_17L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_17L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_17H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_17H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_17H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_17H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_17H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_17H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_17H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_18L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_18L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_18L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_18L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_18L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_18L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_18L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_18H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_18H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_18H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_18H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_18H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_18H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_18H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_19L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_19L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_19L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_19L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_19L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_19L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_19L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_19H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_19H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_19H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_19H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_19H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_19H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_19H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_20L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_20L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_20L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_20L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_20L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_20L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_20L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_20H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_20H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_20H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_20H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_20H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_20H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_20H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_21L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_21L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_21L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_21L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_21L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_21L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_21L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_21H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_21H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_21H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_21H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_21H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_21H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_21H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_22L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_22L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_22L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_22L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_22L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_22L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_22L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_22H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_22H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_22H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_22H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_22H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_22H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_22H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_23L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_23L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_23L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_23L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_23L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_23L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_23L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_23H - ADDR Rejection Filter High */
/*! @{ */

