zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_ARFLT0_23H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_23H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_23H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_23H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_23H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_23H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_24L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_24L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_24L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_24L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_24L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_24L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_24L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_24H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_24H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_24H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_24H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_24H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_24H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_24H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_25L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_25L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_25L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_25L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_25L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_25L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_25L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_25H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_25H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_25H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_25H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_25H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_25H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_25H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_26L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_26L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_26L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_26L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_26L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_26L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_26L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_26H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_26H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_26H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_26H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_26H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_26H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_26H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_27L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_27L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_27L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_27L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_27L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_27L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_27L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_27H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_27H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_27H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_27H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_27H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_27H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_27H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_28L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_28L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_28L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_28L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_28L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_28L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_28L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_28H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_28H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_28H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_28H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_28H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_28H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_28H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_29L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_29L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_29L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_29L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_29L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_29L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_29L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_29H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_29H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_29H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_29H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_29H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_29H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_29H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_30L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_30L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_30L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_30L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_30L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_30L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_30L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_30H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_30H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_30H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_30H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_30H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_30H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_30H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT0_31L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT0_31L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_31L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_31L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_31L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_31L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_31L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT0_31H - ADDR Rejection Filter High */
/*! @{ */

