zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_ARFLT0_31H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT0_31H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT0_31H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT0_31H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT0_31H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT0_31H_ADDRn_H_MASK)
/*! @} */

/*! @name AFCFG1 - Acceptance Filter Configuration */
/*! @{ */

#define CANXL_FILTER_BANK_AFCFG1_ACPTVCAN_MASK   (0x1FU)
#define CANXL_FILTER_BANK_AFCFG1_ACPTVCAN_SHIFT  (0U)
#define CANXL_FILTER_BANK_AFCFG1_ACPTVCAN_WIDTH  (5U)
#define CANXL_FILTER_BANK_AFCFG1_ACPTVCAN(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AFCFG1_ACPTVCAN_SHIFT)) & CANXL_FILTER_BANK_AFCFG1_ACPTVCAN_MASK)

#define CANXL_FILTER_BANK_AFCFG1_AVCANEN_MASK    (0x80U)
#define CANXL_FILTER_BANK_AFCFG1_AVCANEN_SHIFT   (7U)
#define CANXL_FILTER_BANK_AFCFG1_AVCANEN_WIDTH   (1U)
#define CANXL_FILTER_BANK_AFCFG1_AVCANEN(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AFCFG1_AVCANEN_SHIFT)) & CANXL_FILTER_BANK_AFCFG1_AVCANEN_MASK)

#define CANXL_FILTER_BANK_AFCFG1_ACPTSDU_MASK    (0x1F00U)
#define CANXL_FILTER_BANK_AFCFG1_ACPTSDU_SHIFT   (8U)
#define CANXL_FILTER_BANK_AFCFG1_ACPTSDU_WIDTH   (5U)
#define CANXL_FILTER_BANK_AFCFG1_ACPTSDU(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AFCFG1_ACPTSDU_SHIFT)) & CANXL_FILTER_BANK_AFCFG1_ACPTSDU_MASK)

#define CANXL_FILTER_BANK_AFCFG1_ASDUEN_MASK     (0x8000U)
#define CANXL_FILTER_BANK_AFCFG1_ASDUEN_SHIFT    (15U)
#define CANXL_FILTER_BANK_AFCFG1_ASDUEN_WIDTH    (1U)
#define CANXL_FILTER_BANK_AFCFG1_ASDUEN(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AFCFG1_ASDUEN_SHIFT)) & CANXL_FILTER_BANK_AFCFG1_ASDUEN_MASK)

#define CANXL_FILTER_BANK_AFCFG1_ACPTADDR_MASK   (0x1F0000U)
#define CANXL_FILTER_BANK_AFCFG1_ACPTADDR_SHIFT  (16U)
#define CANXL_FILTER_BANK_AFCFG1_ACPTADDR_WIDTH  (5U)
#define CANXL_FILTER_BANK_AFCFG1_ACPTADDR(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AFCFG1_ACPTADDR_SHIFT)) & CANXL_FILTER_BANK_AFCFG1_ACPTADDR_MASK)

#define CANXL_FILTER_BANK_AFCFG1_AADDREN_MASK    (0x800000U)
#define CANXL_FILTER_BANK_AFCFG1_AADDREN_SHIFT   (23U)
#define CANXL_FILTER_BANK_AFCFG1_AADDREN_WIDTH   (1U)
#define CANXL_FILTER_BANK_AFCFG1_AADDREN(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AFCFG1_AADDREN_SHIFT)) & CANXL_FILTER_BANK_AFCFG1_AADDREN_MASK)
/*! @} */

/*! @name VAMRCFG1 - VCAN Acceptance Mask or Range Configuration */
/*! @{ */

#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R0_MASK  (0x1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R0_SHIFT (0U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R0_WIDTH (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R0(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAMRCFG1_VMSK0R0_SHIFT)) & CANXL_FILTER_BANK_VAMRCFG1_VMSK0R0_MASK)

#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R1_MASK  (0x2U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R1_SHIFT (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R1_WIDTH (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R1(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAMRCFG1_VMSK0R1_SHIFT)) & CANXL_FILTER_BANK_VAMRCFG1_VMSK0R1_MASK)

#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R2_MASK  (0x4U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R2_SHIFT (2U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R2_WIDTH (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R2(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAMRCFG1_VMSK0R2_SHIFT)) & CANXL_FILTER_BANK_VAMRCFG1_VMSK0R2_MASK)

#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R3_MASK  (0x8U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R3_SHIFT (3U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R3_WIDTH (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R3(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAMRCFG1_VMSK0R3_SHIFT)) & CANXL_FILTER_BANK_VAMRCFG1_VMSK0R3_MASK)

#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R4_MASK  (0x10U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R4_SHIFT (4U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R4_WIDTH (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R4(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAMRCFG1_VMSK0R4_SHIFT)) & CANXL_FILTER_BANK_VAMRCFG1_VMSK0R4_MASK)

#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R5_MASK  (0x20U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R5_SHIFT (5U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R5_WIDTH (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R5(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAMRCFG1_VMSK0R5_SHIFT)) & CANXL_FILTER_BANK_VAMRCFG1_VMSK0R5_MASK)

#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R6_MASK  (0x40U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R6_SHIFT (6U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R6_WIDTH (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R6(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAMRCFG1_VMSK0R6_SHIFT)) & CANXL_FILTER_BANK_VAMRCFG1_VMSK0R6_MASK)

#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R7_MASK  (0x80U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R7_SHIFT (7U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R7_WIDTH (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R7(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAMRCFG1_VMSK0R7_SHIFT)) & CANXL_FILTER_BANK_VAMRCFG1_VMSK0R7_MASK)

#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R8_MASK  (0x100U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R8_SHIFT (8U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R8_WIDTH (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R8(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAMRCFG1_VMSK0R8_SHIFT)) & CANXL_FILTER_BANK_VAMRCFG1_VMSK0R8_MASK)

#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R9_MASK  (0x200U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R9_SHIFT (9U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R9_WIDTH (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R9(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAMRCFG1_VMSK0R9_SHIFT)) & CANXL_FILTER_BANK_VAMRCFG1_VMSK0R9_MASK)

#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R10_MASK (0x400U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R10_SHIFT (10U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R10_WIDTH (1U)
#define CANXL_FILTER_BANK_VAMRCFG1_VMSK0R10(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAMRCFG1_VMSK0R10_SHIFT)) & CANXL_FILTER_BANK_VAMRCFG1_VMSK0R10_MASK)

