zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R26_MASK (0x4000000U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R26_SHIFT (26U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R26_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R26(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG1_AMSK0R26_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG1_AMSK0R26_MASK)

#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R27_MASK (0x8000000U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R27_SHIFT (27U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R27_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R27(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG1_AMSK0R27_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG1_AMSK0R27_MASK)

#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R28_MASK (0x10000000U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R28_SHIFT (28U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R28_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R28(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG1_AMSK0R28_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG1_AMSK0R28_MASK)

#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R29_MASK (0x20000000U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R29_SHIFT (29U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R29_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R29(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG1_AMSK0R29_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG1_AMSK0R29_MASK)

#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R30_MASK (0x40000000U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R30_SHIFT (30U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R30_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R30(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG1_AMSK0R30_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG1_AMSK0R30_MASK)

#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R31_MASK (0x80000000U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R31_SHIFT (31U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R31_WIDTH (1U)
#define CANXL_FILTER_BANK_AAMRCFG1_AMSK0R31(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAMRCFG1_AMSK0R31_SHIFT)) & CANXL_FILTER_BANK_AAMRCFG1_AMSK0R31_MASK)
/*! @} */

/*! @name VAFLT1_0 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT1_0_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_0_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_0_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_0_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_0_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_0_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT1_0_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_0_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_0_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_0_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_0_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_0_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_0_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT1_2 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT1_2_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_2_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_2_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_2_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_2_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_2_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT1_2_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_2_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_2_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_2_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_2_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_2_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_2_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT1_4 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT1_4_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_4_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_4_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_4_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_4_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_4_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT1_4_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_4_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_4_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_4_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_4_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_4_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_4_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT1_6 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT1_6_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_6_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_6_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_6_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_6_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_6_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT1_6_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_6_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_6_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_6_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_6_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_6_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_6_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT1_8 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT1_8_VCANa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_8_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_8_VCANa_L_MASK)

