zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_VAFLT1_8_VCANa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_8_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_8_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT1_8_VCANb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_8_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_8_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_8_VCANb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_8_VCANb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_8_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_8_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT1_10 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT1_10_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_10_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_10_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_10_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_10_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_10_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT1_10_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_10_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_10_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_10_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_10_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_10_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_10_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT1_12 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT1_12_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_12_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_12_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_12_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_12_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_12_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT1_12_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_12_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_12_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_12_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_12_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_12_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_12_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT1_14 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT1_14_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_14_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_14_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_14_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_14_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_14_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT1_14_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_14_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_14_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_14_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_14_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_14_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_14_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT1_16 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT1_16_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_16_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_16_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_16_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_16_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_16_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT1_16_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_16_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_16_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_16_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_16_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_16_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_16_VCANb_H_MASK)
/*! @} */

