zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name VAFLT1_28 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT1_28_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_28_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_28_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_28_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_28_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_28_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT1_28_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_28_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_28_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_28_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_28_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_28_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_28_VCANb_H_MASK)
/*! @} */

/*! @name VAFLT1_30 - VCAN Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VAFLT1_30_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_30_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_30_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_30_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_30_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_30_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VAFLT1_30_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_30_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_30_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VAFLT1_30_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VAFLT1_30_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VAFLT1_30_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VAFLT1_30_VCANb_H_MASK)
/*! @} */

/*! @name SAFLT1_0 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_0_SDUa_L_MASK   (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUa_L_SHIFT  (0U)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUa_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUa_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_0_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_0_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_0_SDUa_H_MASK   (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUa_H_SHIFT  (8U)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUa_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUa_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_0_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_0_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_0_SDUb_L_MASK   (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUb_L_SHIFT  (16U)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUb_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUb_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_0_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_0_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_0_SDUb_H_MASK   (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUb_H_SHIFT  (24U)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUb_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_0_SDUb_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_0_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_0_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_2 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_2_SDUa_L_MASK   (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUa_L_SHIFT  (0U)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUa_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUa_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_2_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_2_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_2_SDUa_H_MASK   (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUa_H_SHIFT  (8U)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUa_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUa_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_2_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_2_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_2_SDUb_L_MASK   (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUb_L_SHIFT  (16U)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUb_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUb_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_2_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_2_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_2_SDUb_H_MASK   (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUb_H_SHIFT  (24U)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUb_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_2_SDUb_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_2_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_2_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_4 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_4_SDUa_L_MASK   (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUa_L_SHIFT  (0U)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUa_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUa_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_4_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_4_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_4_SDUa_H_MASK   (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUa_H_SHIFT  (8U)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUa_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUa_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_4_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_4_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_4_SDUb_L_MASK   (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUb_L_SHIFT  (16U)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUb_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUb_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_4_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_4_SDUb_L_MASK)

