zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_SAFLT1_4_SDUb_H_MASK   (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUb_H_SHIFT  (24U)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUb_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_4_SDUb_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_4_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_4_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_6 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_6_SDUa_L_MASK   (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUa_L_SHIFT  (0U)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUa_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUa_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_6_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_6_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_6_SDUa_H_MASK   (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUa_H_SHIFT  (8U)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUa_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUa_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_6_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_6_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_6_SDUb_L_MASK   (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUb_L_SHIFT  (16U)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUb_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUb_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_6_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_6_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_6_SDUb_H_MASK   (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUb_H_SHIFT  (24U)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUb_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_6_SDUb_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_6_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_6_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_8 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_8_SDUa_L_MASK   (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUa_L_SHIFT  (0U)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUa_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUa_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_8_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_8_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_8_SDUa_H_MASK   (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUa_H_SHIFT  (8U)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUa_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUa_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_8_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_8_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_8_SDUb_L_MASK   (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUb_L_SHIFT  (16U)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUb_L_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUb_L(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_8_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_8_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_8_SDUb_H_MASK   (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUb_H_SHIFT  (24U)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUb_H_WIDTH  (8U)
#define CANXL_FILTER_BANK_SAFLT1_8_SDUb_H(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_8_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_8_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_10 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_10_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_10_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_10_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_10_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_10_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_10_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_10_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_10_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_10_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_10_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_10_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_10_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_10_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_12 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_12_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_12_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_12_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_12_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_12_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_12_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_12_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_12_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_12_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_12_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_12_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_12_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_12_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_14 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_14_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_14_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_14_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_14_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_14_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_14_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_14_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_14_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_14_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_14_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_14_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_14_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_14_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_16 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_16_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_16_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_16_SDUa_L_MASK)

