zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_SAFLT1_16_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_16_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_16_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_16_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_16_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_16_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_16_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_16_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_16_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_16_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_18 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_18_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_18_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_18_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_18_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_18_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_18_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_18_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_18_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_18_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_18_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_18_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_18_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_18_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_20 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_20_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_20_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_20_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_20_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_20_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_20_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_20_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_20_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_20_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_20_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_20_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_20_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_20_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_22 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_22_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_22_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_22_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_22_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_22_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_22_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_22_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_22_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_22_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_22_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_22_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_22_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_22_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_24 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_24_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_24_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_24_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_24_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_24_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_24_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_24_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_24_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_24_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_24_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_24_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_24_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_24_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_26 - SDU Acceptance Filter */
/*! @{ */

