zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_SAFLT1_26_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_26_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_26_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_26_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_26_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_26_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_26_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_26_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_26_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_26_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_26_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_26_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_26_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_28 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_28_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_28_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_28_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_28_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_28_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_28_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_28_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_28_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_28_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_28_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_28_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_28_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_28_SDUb_H_MASK)
/*! @} */

/*! @name SAFLT1_30 - SDU Acceptance Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SAFLT1_30_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_30_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_30_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_30_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_30_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_30_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SAFLT1_30_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_30_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_30_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SAFLT1_30_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SAFLT1_30_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SAFLT1_30_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SAFLT1_30_SDUb_H_MASK)
/*! @} */

/*! @name AAFLT1_0L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_0L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_0L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_0L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_0L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_0L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_0L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_0H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_0H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_0H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_0H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_0H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_0H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_0H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_1L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_1L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_1L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_1L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_1L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_1L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_1L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_1H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_1H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_1H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_1H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_1H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_1H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_1H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_2L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_2L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_2L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_2L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_2L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_2L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_2L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_2H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_2H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_2H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_2H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_2H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_2H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_2H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_3L - ADDR Acceptance Filter Low */
/*! @{ */

