zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_AAFLT1_3L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_3L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_3L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_3L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_3L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_3L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_3H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_3H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_3H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_3H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_3H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_3H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_3H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_4L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_4L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_4L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_4L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_4L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_4L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_4L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_4H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_4H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_4H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_4H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_4H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_4H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_4H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_5L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_5L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_5L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_5L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_5L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_5L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_5L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_5H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_5H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_5H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_5H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_5H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_5H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_5H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_6L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_6L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_6L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_6L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_6L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_6L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_6L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_6H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_6H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_6H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_6H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_6H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_6H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_6H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_7L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_7L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_7L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_7L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_7L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_7L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_7L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_7H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_7H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_7H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_7H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_7H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_7H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_7H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_8L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_8L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_8L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_8L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_8L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_8L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_8L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_8H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_8H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_8H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_8H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_8H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_8H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_8H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_9L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_9L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_9L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_9L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_9L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_9L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_9L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_9H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_9H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_9H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_9H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_9H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_9H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_9H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_10L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_10L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_10L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_10L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_10L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_10L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_10L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_10H - ADDR Acceptance Filter High */
/*! @{ */

