zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_AAFLT1_10H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_10H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_10H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_10H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_10H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_10H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_11L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_11L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_11L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_11L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_11L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_11L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_11L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_11H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_11H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_11H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_11H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_11H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_11H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_11H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_12L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_12L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_12L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_12L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_12L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_12L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_12L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_12H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_12H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_12H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_12H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_12H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_12H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_12H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_13L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_13L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_13L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_13L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_13L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_13L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_13L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_13H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_13H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_13H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_13H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_13H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_13H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_13H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_14L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_14L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_14L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_14L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_14L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_14L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_14L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_14H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_14H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_14H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_14H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_14H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_14H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_14H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_15L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_15L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_15L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_15L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_15L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_15L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_15L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_15H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_15H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_15H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_15H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_15H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_15H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_15H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_16L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_16L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_16L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_16L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_16L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_16L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_16L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_16H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_16H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_16H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_16H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_16H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_16H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_16H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_17L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_17L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_17L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_17L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_17L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_17L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_17L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_17H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_17H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_17H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_17H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_17H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_17H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_17H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_18L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_18L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_18L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_18L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_18L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_18L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_18L_ADDRn_L_MASK)
/*! @} */

