zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name AAFLT1_18H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_18H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_18H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_18H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_18H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_18H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_18H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_19L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_19L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_19L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_19L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_19L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_19L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_19L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_19H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_19H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_19H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_19H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_19H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_19H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_19H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_20L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_20L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_20L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_20L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_20L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_20L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_20L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_20H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_20H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_20H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_20H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_20H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_20H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_20H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_21L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_21L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_21L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_21L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_21L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_21L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_21L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_21H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_21H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_21H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_21H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_21H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_21H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_21H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_22L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_22L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_22L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_22L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_22L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_22L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_22L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_22H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_22H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_22H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_22H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_22H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_22H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_22H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_23L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_23L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_23L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_23L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_23L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_23L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_23L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_23H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_23H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_23H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_23H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_23H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_23H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_23H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_24L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_24L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_24L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_24L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_24L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_24L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_24L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_24H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_24H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_24H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_24H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_24H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_24H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_24H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_25L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_25L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_25L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_25L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_25L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_25L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_25L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_25H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_25H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_25H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_25H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_25H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_25H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_25H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_26L - ADDR Acceptance Filter Low */
/*! @{ */

