zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_AAFLT1_26L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_26L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_26L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_26L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_26L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_26L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_26H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_26H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_26H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_26H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_26H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_26H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_26H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_27L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_27L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_27L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_27L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_27L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_27L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_27L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_27H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_27H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_27H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_27H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_27H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_27H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_27H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_28L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_28L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_28L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_28L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_28L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_28L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_28L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_28H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_28H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_28H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_28H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_28H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_28H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_28H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_29L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_29L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_29L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_29L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_29L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_29L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_29L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_29H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_29H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_29H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_29H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_29H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_29H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_29H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_30L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_30L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_30L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_30L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_30L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_30L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_30L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_30H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_30H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_30H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_30H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_30H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_30H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_30H_ADDRn_H_MASK)
/*! @} */

/*! @name AAFLT1_31L - ADDR Acceptance Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_31L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_31L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_31L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_31L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_31L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_31L_ADDRn_L_MASK)
/*! @} */

/*! @name AAFLT1_31H - ADDR Acceptance Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_AAFLT1_31H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_AAFLT1_31H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_AAFLT1_31H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_AAFLT1_31H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_AAFLT1_31H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_AAFLT1_31H_ADDRn_H_MASK)
/*! @} */

/*! @name RFCFG1 - Rejection Filter Configuration */
/*! @{ */

#define CANXL_FILTER_BANK_RFCFG1_REJVCAN_MASK    (0x1FU)
#define CANXL_FILTER_BANK_RFCFG1_REJVCAN_SHIFT   (0U)
#define CANXL_FILTER_BANK_RFCFG1_REJVCAN_WIDTH   (5U)
#define CANXL_FILTER_BANK_RFCFG1_REJVCAN(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_RFCFG1_REJVCAN_SHIFT)) & CANXL_FILTER_BANK_RFCFG1_REJVCAN_MASK)

#define CANXL_FILTER_BANK_RFCFG1_RVCANEN_MASK    (0x80U)
#define CANXL_FILTER_BANK_RFCFG1_RVCANEN_SHIFT   (7U)
#define CANXL_FILTER_BANK_RFCFG1_RVCANEN_WIDTH   (1U)
#define CANXL_FILTER_BANK_RFCFG1_RVCANEN(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_RFCFG1_RVCANEN_SHIFT)) & CANXL_FILTER_BANK_RFCFG1_RVCANEN_MASK)

#define CANXL_FILTER_BANK_RFCFG1_REJSDU_MASK     (0x1F00U)
#define CANXL_FILTER_BANK_RFCFG1_REJSDU_SHIFT    (8U)
#define CANXL_FILTER_BANK_RFCFG1_REJSDU_WIDTH    (5U)
#define CANXL_FILTER_BANK_RFCFG1_REJSDU(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_RFCFG1_REJSDU_SHIFT)) & CANXL_FILTER_BANK_RFCFG1_REJSDU_MASK)

