zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name VRFLT1_22 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT1_22_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_22_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_22_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT1_22_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_22_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_22_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT1_22_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_22_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_22_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT1_22_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_22_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_22_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_22_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT1_24 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT1_24_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_24_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_24_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT1_24_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_24_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_24_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT1_24_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_24_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_24_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT1_24_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_24_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_24_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_24_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT1_26 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT1_26_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_26_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_26_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT1_26_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_26_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_26_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT1_26_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_26_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_26_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT1_26_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_26_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_26_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_26_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT1_28 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT1_28_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_28_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_28_VCANa_L_MASK)

#define CANXL_FILTER_BANK_VRFLT1_28_VCANa_H_MASK (0xFF00U)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANa_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_28_VCANa_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_28_VCANa_H_MASK)

#define CANXL_FILTER_BANK_VRFLT1_28_VCANb_L_MASK (0xFF0000U)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANb_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_28_VCANb_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_28_VCANb_L_MASK)

#define CANXL_FILTER_BANK_VRFLT1_28_VCANb_H_MASK (0xFF000000U)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_28_VCANb_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_28_VCANb_H_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_28_VCANb_H_MASK)
/*! @} */

/*! @name VRFLT1_30 - VCAN Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_VRFLT1_30_VCANa_L_MASK (0xFFU)
#define CANXL_FILTER_BANK_VRFLT1_30_VCANa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_VRFLT1_30_VCANa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_VRFLT1_30_VCANa_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_VRFLT1_30_VCANa_L_SHIFT)) & CANXL_FILTER_BANK_VRFLT1_30_VCANa_L_MASK)

