zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
#define CANXL_FILTER_BANK_SRFLT1_20_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SRFLT1_20_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SRFLT1_20_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_20_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_20_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_20_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SRFLT1_20_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SRFLT1_20_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SRFLT1_20_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_20_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_20_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_20_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SRFLT1_20_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SRFLT1_20_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SRFLT1_20_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_20_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_20_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_20_SDUb_H_MASK)
/*! @} */

/*! @name SRFLT1_22 - SDU Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SRFLT1_22_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_22_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_22_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SRFLT1_22_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_22_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_22_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SRFLT1_22_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_22_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_22_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SRFLT1_22_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_22_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_22_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_22_SDUb_H_MASK)
/*! @} */

/*! @name SRFLT1_24 - SDU Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SRFLT1_24_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_24_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_24_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SRFLT1_24_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_24_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_24_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SRFLT1_24_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_24_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_24_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SRFLT1_24_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_24_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_24_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_24_SDUb_H_MASK)
/*! @} */

/*! @name SRFLT1_26 - SDU Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SRFLT1_26_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_26_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_26_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SRFLT1_26_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_26_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_26_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SRFLT1_26_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_26_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_26_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SRFLT1_26_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_26_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_26_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_26_SDUb_H_MASK)
/*! @} */

/*! @name SRFLT1_28 - SDU Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SRFLT1_28_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_28_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_28_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SRFLT1_28_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_28_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_28_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SRFLT1_28_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_28_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_28_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SRFLT1_28_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_28_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_28_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_28_SDUb_H_MASK)
/*! @} */

