zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name SRFLT1_30 - SDU Rejection Filter */
/*! @{ */

#define CANXL_FILTER_BANK_SRFLT1_30_SDUa_L_MASK  (0xFFU)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUa_L_SHIFT (0U)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUa_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUa_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_30_SDUa_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_30_SDUa_L_MASK)

#define CANXL_FILTER_BANK_SRFLT1_30_SDUa_H_MASK  (0xFF00U)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUa_H_SHIFT (8U)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUa_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUa_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_30_SDUa_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_30_SDUa_H_MASK)

#define CANXL_FILTER_BANK_SRFLT1_30_SDUb_L_MASK  (0xFF0000U)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUb_L_SHIFT (16U)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUb_L_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUb_L(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_30_SDUb_L_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_30_SDUb_L_MASK)

#define CANXL_FILTER_BANK_SRFLT1_30_SDUb_H_MASK  (0xFF000000U)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUb_H_SHIFT (24U)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUb_H_WIDTH (8U)
#define CANXL_FILTER_BANK_SRFLT1_30_SDUb_H(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_SRFLT1_30_SDUb_H_SHIFT)) & CANXL_FILTER_BANK_SRFLT1_30_SDUb_H_MASK)
/*! @} */

/*! @name ARFLT1_0L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_0L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_0L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_0L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_0L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_0L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_0L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_0H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_0H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_0H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_0H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_0H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_0H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_0H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_1L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_1L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_1L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_1L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_1L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_1L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_1L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_1H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_1H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_1H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_1H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_1H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_1H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_1H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_2L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_2L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_2L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_2L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_2L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_2L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_2L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_2H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_2H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_2H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_2H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_2H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_2H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_2H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_3L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_3L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_3L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_3L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_3L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_3L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_3L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_3H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_3H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_3H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_3H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_3H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_3H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_3H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_4L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_4L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_4L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_4L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_4L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_4L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_4L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_4H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_4H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_4H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_4H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_4H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_4H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_4H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_5L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_5L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_5L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_5L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_5L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_5L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_5L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_5H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_5H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_5H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_5H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_5H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_5H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_5H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_6L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_6L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_6L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_6L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_6L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_6L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_6L_ADDRn_L_MASK)
/*! @} */

