zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name ARFLT1_6H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_6H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_6H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_6H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_6H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_6H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_6H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_7L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_7L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_7L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_7L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_7L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_7L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_7L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_7H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_7H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_7H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_7H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_7H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_7H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_7H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_8L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_8L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_8L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_8L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_8L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_8L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_8L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_8H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_8H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_8H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_8H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_8H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_8H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_8H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_9L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_9L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_9L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_9L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_9L_ADDRn_L(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_9L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_9L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_9H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_9H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_9H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_9H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_9H_ADDRn_H(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_9H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_9H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_10L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_10L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_10L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_10L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_10L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_10L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_10L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_10H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_10H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_10H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_10H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_10H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_10H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_10H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_11L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_11L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_11L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_11L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_11L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_11L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_11L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_11H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_11H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_11H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_11H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_11H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_11H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_11H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_12L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_12L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_12L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_12L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_12L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_12L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_12L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_12H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_12H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_12H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_12H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_12H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_12H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_12H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_13L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_13L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_13L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_13L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_13L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_13L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_13L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_13H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_13H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_13H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_13H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_13H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_13H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_13H_ADDRn_H_MASK)
/*! @} */

