zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name ARFLT1_14L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_14L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_14L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_14L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_14L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_14L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_14L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_14H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_14H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_14H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_14H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_14H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_14H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_14H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_15L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_15L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_15L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_15L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_15L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_15L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_15L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_15H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_15H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_15H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_15H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_15H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_15H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_15H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_16L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_16L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_16L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_16L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_16L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_16L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_16L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_16H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_16H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_16H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_16H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_16H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_16H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_16H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_17L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_17L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_17L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_17L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_17L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_17L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_17L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_17H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_17H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_17H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_17H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_17H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_17H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_17H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_18L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_18L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_18L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_18L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_18L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_18L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_18L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_18H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_18H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_18H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_18H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_18H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_18H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_18H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_19L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_19L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_19L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_19L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_19L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_19L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_19L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_19H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_19H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_19H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_19H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_19H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_19H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_19H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_20L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_20L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_20L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_20L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_20L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_20L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_20L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_20H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_20H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_20H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_20H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_20H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_20H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_20H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_21L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_21L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_21L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_21L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_21L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_21L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_21L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_21H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_21H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_21H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_21H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_21H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_21H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_21H_ADDRn_H_MASK)
/*! @} */

