zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name ARFLT1_22L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_22L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_22L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_22L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_22L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_22L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_22L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_22H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_22H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_22H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_22H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_22H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_22H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_22H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_23L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_23L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_23L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_23L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_23L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_23L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_23L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_23H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_23H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_23H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_23H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_23H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_23H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_23H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_24L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_24L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_24L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_24L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_24L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_24L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_24L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_24H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_24H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_24H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_24H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_24H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_24H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_24H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_25L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_25L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_25L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_25L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_25L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_25L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_25L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_25H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_25H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_25H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_25H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_25H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_25H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_25H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_26L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_26L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_26L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_26L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_26L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_26L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_26L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_26H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_26H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_26H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_26H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_26H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_26H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_26H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_27L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_27L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_27L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_27L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_27L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_27L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_27L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_27H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_27H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_27H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_27H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_27H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_27H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_27H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_28L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_28L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_28L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_28L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_28L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_28L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_28L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_28H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_28H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_28H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_28H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_28H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_28H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_28H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_29L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_29L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_29L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_29L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_29L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_29L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_29L_ADDRn_L_MASK)
/*! @} */

