zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_FILTER_BANK.h
/*! @name ARFLT1_29H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_29H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_29H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_29H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_29H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_29H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_29H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_30L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_30L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_30L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_30L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_30L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_30L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_30L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_30H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_30H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_30H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_30H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_30H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_30H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_30H_ADDRn_H_MASK)
/*! @} */

/*! @name ARFLT1_31L - ADDR Rejection Filter Low */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_31L_ADDRn_L_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_31L_ADDRn_L_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_31L_ADDRn_L_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_31L_ADDRn_L(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_31L_ADDRn_L_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_31L_ADDRn_L_MASK)
/*! @} */

/*! @name ARFLT1_31H - ADDR Rejection Filter High */
/*! @{ */

#define CANXL_FILTER_BANK_ARFLT1_31H_ADDRn_H_MASK (0xFFFFFFFFU)
#define CANXL_FILTER_BANK_ARFLT1_31H_ADDRn_H_SHIFT (0U)
#define CANXL_FILTER_BANK_ARFLT1_31H_ADDRn_H_WIDTH (32U)
#define CANXL_FILTER_BANK_ARFLT1_31H_ADDRn_H(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_FILTER_BANK_ARFLT1_31H_ADDRn_H_SHIFT)) & CANXL_FILTER_BANK_ARFLT1_31H_ADDRn_H_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group CANXL_FILTER_BANK_Register_Masks */

/*!
 * @}
 */ /* end of group CANXL_FILTER_BANK_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_CANXL_FILTER_BANK_H_) */
